# ConnectorTolerance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..ConnectorTolerance Property
PipeSettings Class See Also
---
The connector tolerance value.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double ConnectorTolerance { get; set; }
```

Visual Basic
---
```text
Public Property ConnectorTolerance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ConnectorTolerance {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for dValue is not finite |

# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace